#+TITLE: eduardo's website title
#+bibliography: ./refs.bib
#+options: broken-links:mark toc:nil
#+HUGO_BASE_DIR: ../
#+HUGO_PAIRED_SHORTCODES: alert image
#+AUTHOR: Eduardo Bellani

*** On capacity planning

As can be seen on the [[laying_foundation][foundational code block]], we have 5 core tables

1. ~finance.transfer~
2. ~finance.transfer_status_log~
3. ~finance.pending_transaction~
4. ~finance.settled_transaction~

    Taking ~finance.transfer~ as a
reference, we have this total (ignoring alignment issues
[cite:@thomas2018rocksandsand]):

| Name                           | Type        | Size(bytes) |
|--------------------------------+-------------+-------------|
| transfer_created_at            | timestamptz |           8 |
| account_number                 | text(12)    |          13 |
| routing_number                 | text(9)     |          10 |
| counterparty_account_number    | text(12)    |          13 |
| counterparty_routing_number    | text(9)     |          10 |
| amount                         | bigint      |           8 |
| status                         | text(10)    |          11 |
|--------------------------------+-------------+-------------|
| Total (plus 24 for row header) |             |          97 |
#+TBLFM: @>$>=vsum(@I..@II)+24

So, around 100 bytes per row. Suppose we want 3 days of transfers and 1
day of transactions, that would be 6 (3 ~finance.transfer~ + 3
~finance.transfer_status_log~) + 2 (1 ~finance.pending_transaction~ + 1
~finance.settled_transaction~).

Assuming 10k accounts each having 100 transfer/pending/settled per day,
that would necessitate ~7.5 GB of RAM. For a mid/large bank like Nubank
with 50 million accounts: ~38GB. For a global payment processor like
VISA: ~700GB.

As for indexes:
#+begin_quote
index entry has an overhead of 8 bytes. Add the average size of your
indexed data (in the internal binary format).[cite:@StackOverflowAlbe2020indexsize]
#+end_quote

Given that in this design we are using a single index for each table
(the btree backing the primary key), you can add 100% for the index
size, doubling the amounts above. That gives us 15GB, 76GB, and 1.4TB
respectively.

These fit comfortably in modern database servers (AWS RDS db.r6g.4xlarge
has 128GB RAM, db.r6g.16xlarge has 512GB).

*The point*: You don't need partitioning, sharding, or distributed
databases. You need appropriately sized hardware and good index design.

